input: "in_data"
input_dim: 2
input_dim: 2
input_dim: 10
input_dim: 10

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "in_data"
  top: "conv1"

  convolution_param {
    num_output: 2
    kernel_size: 5
    pad: 2
  }
}

layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"

  pooling_param {
    pool: MAX
    kernel_size: 5
    stride: 2
  }
}

layer {
  name: "crop_patch_max_fea_pos"
  type: "CropPatchFromMaxFeaturePosition"
  bottom: "in_data"
  bottom: "pool1"

  bottom: "in_data"
  top: "out_data"
}
