input: "data"
input_dim: 2
input_dim: 2
input_dim: 10
input_dim: 10

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"

  convolution_param {
    num_output: 128
    kernel_size: 5
    pad: 2
  }
}

layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"

  pooling_param {
    pool: MAX
    kernel_size: 5
    stride: 2
  }
}

layer {
  name: "resize_with_map"
  type: "ResizeWithMap"
  bottom: "data"
  bottom: "pool1"

  bottom: "data"
  top: "data1"
}
