input: "in_data"
input_dim: 2
input_dim: 2
input_dim: 5
input_dim: 5

input: "in_data1"
input_dim: 2
input_dim: 2
input_dim: 5
input_dim: 5

layer {
  name: "resize"
  type: "Resize"
  bottom: "in_data"
  top: "resize1"

  resize_param {
    height: 2
    width: 2
  }
}

layer {
  name: "resize_with_map"
  type: "ResizeWithMap"
  bottom: "in_data"
  bottom: "resize1"

  bottom: "in_data"
  top: "out_data"

  bottom: "in_data1"
  top: "out_data1"
}
