# ##############################
# @proto: train_val.prototxt
# @author: ddk
# @method: heat map
# @time: 16.01.03
# ##############################
name: "HumanPoseEstimation"

# ##############################
# data & mask & heat map
layer {
  name: "data"
  type: "RandomImageData2"
  top: "data"
  top: "gt_pose_coords"
  top: "aux_info"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    # opencv: B, G, R
  }
  random_image_data2_param {
    source: "../dataset/FLIC/labels/crop_train_labels2.txt"
    root_folder: "../dataset/FLIC/crop.images2/train/"
    label_num: 28
    batch_size: 12
    always_max_size: true
    is_scale_image: true
    shuffle: true
    max_size: 256
    min_size: 240
    is_color: true
    img_ext: ".jpg"
    parts_orders_path: "../dataset/FLIC/labels/parts_orders_path.txt"
  }
}

layer {
  name: "data"
  type: "RandomImageData2"
  top: "data"
  top: "gt_pose_coords"
  top: "aux_info"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    # opencv: B, G, R
  }
  random_image_data2_param {
    source: "../dataset/FLIC/labels/crop_test_labels2.txt"
    root_folder: "../dataset/FLIC/crop.images2/test/"
    label_num: 28
    batch_size: 8
    always_max_size: true
    is_scale_image: true
    shuffle: false
    max_size: 256
    min_size: 240
    is_color: true
    img_ext: ".jpg"
    parts_orders_path: "../dataset/FLIC/labels/parts_orders_path.txt"
  }
}

layer {
  name: "torso_masks"
  type: "CoordsToBboxesMasks"
  bottom: "gt_pose_coords"
  bottom: "aux_info"
  top: "torso_masks"
  coord_to_bbox_masks_param {
    top_id: 6
    bottom_id: 10
    top_id2: 6
    bottom_id2: 10
    value: 255
  }
}

layer {
  name: "concat_data"
  type: "Concat"
  bottom: "data"
  bottom: "torso_masks"
  top: "data_bank1"
  concat_param {
    concat_dim: 1
  }
}

layer {
  name: "data_bank2"
  type: "Resize"
  bottom: "data_bank1"
  top: "data_bank2"
  resize_param {
    height_fac: 0.707
    width_fac: 0.707
  }
}

layer {
  name: "heat_maps_from_coords"
  type: "HeatMapsFromCoordsOrigin"
  bottom: "gt_pose_coords"
  bottom: "aux_info"
  top: "heat_maps"
  top: "heat_maps_masks"
  top: "heat_maps_infos"
  heat_maps_from_coords_origin_param {
    is_binary: true
    gau_mean: 0
    gau_stds: 1.5
    radius_str: "3,3,3,8,8,6,8,8,6,8,8,8,8,8"
  }
}


# ##############################
# bank1
# conv & relu & pool & resize
layer {
  name: "conv1_bank1"
  type: "Convolution"
  bottom: "data_bank1"
  top: "conv1_bank1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "relu1_bank1"
  type: "ReLU"
  bottom: "conv1_bank1"
  top: "conv1_bank1"
}

layer {
  name: "pool1_bank1"
  type: "Pooling"
  bottom: "conv1_bank1"
  top: "pool1_bank1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

# ########### conv2_bank1
layer {
  name: "conv2_bank1"
  type: "Convolution"
  bottom: "pool1_bank1"
  top: "conv2_bank1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "relu2_bank1"
  type: "ReLU"
  bottom: "conv2_bank1"
  top: "conv2_bank1"
}

layer {
  name: "pool2_bank1"
  type: "Pooling"
  bottom: "conv2_bank1"
  top: "pool2_bank1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

# ########### conv3_bank1
layer {
  name: "conv3_bank1"
  type: "Convolution"
  bottom: "pool2_bank1"
  top: "conv3_bank1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "relu3_bank1"
  type: "ReLU"
  bottom: "conv3_bank1"
  top: "conv3_bank1"
}

layer {
  name: "pool3_bank1"
  type: "Pooling"
  bottom: "conv3_bank1"
  top: "pool3_bank1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

# ########### conv4_1_bank1
layer {
  name: "conv4_1_bank1"
  type: "Convolution"
  bottom: "pool3_bank1"
  top: "conv4_1_bank1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "relu4_1_bank1"
  type: "ReLU"
  bottom: "conv4_1_bank1"
  top: "conv4_1_bank1"
}

# ########### conv4_2_bank1
layer {
  name: "conv4_2_bank1"
  type: "Convolution"
  bottom: "conv4_1_bank1"
  top: "conv4_2_bank1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 4
    kernel_size: 9
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "relu4_2_bank1"
  type: "ReLU"
  bottom: "conv4_2_bank1"
  top: "conv4_2_bank1"
}

# ########### conv4_bank1 for dsn
# loss
# conv & resize
layer {
  name: "dsn_conv4_bank1"
  type: "Convolution"
  bottom: "conv4_2_bank1"
  top: "dsn_conv4_bank1"
  param {
    lr_mult: 0.01
    decay_mult: 1
  }
  param {
    lr_mult: 0.02
    decay_mult: 0
  }
  convolution_param {
    num_output: 14
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "re_heat_maps_dsn_conv4_bank1"
  type: "Resize"
  bottom: "heat_maps"
  bottom: "dsn_conv4_bank1"
  top: "re_heat_maps_dsn_conv4_bank1"
  include {
    phase: TRAIN
  }
}

layer {
  name: "pose_heap_map_loss_by_conv4_bank1"
  type: "PoseHeatMapLoss"
  bottom: "dsn_conv4_bank1"
  bottom: "re_heat_maps_dsn_conv4_bank1"
  bottom: "heat_maps_masks"
  top: "pose_heap_map_loss_by_conv4_bank1"
  include {
    phase: TRAIN
  }
  loss_weight: 1
  pose_heat_map_loss_param {
    loss_emphase_type: 3
    fg_eof: 3
    bg_eof: 1
    ratio: 0.005
    prob_num: 11
    heat_score_thres: 0.273
    parts_err_num_thres: 3
    hard_negative_filepath: "NotImplemented."
  }
}

# ##############################
# bank2
# conv & relu & pool & resize
layer {
  name: "conv1_bank2"
  type: "Convolution"
  bottom: "data_bank2"
  top: "conv1_bank2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "relu1_bank2"
  type: "ReLU"
  bottom: "conv1_bank2"
  top: "conv1_bank2"
}

layer {
  name: "pool1_bank2"
  type: "Pooling"
  bottom: "conv1_bank2"
  top: "pool1_bank2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

# ########### conv2_bank2
layer {
  name: "conv2_bank2"
  type: "Convolution"
  bottom: "pool1_bank2"
  top: "conv2_bank2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "relu2_bank2"
  type: "ReLU"
  bottom: "conv2_bank2"
  top: "conv2_bank2"
}

layer {
  name: "pool2_bank2"
  type: "Pooling"
  bottom: "conv2_bank2"
  top: "pool2_bank2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

# ########### conv3_bank2
layer {
  name: "conv3_bank2"
  type: "Convolution"
  bottom: "pool2_bank2"
  top: "conv3_bank2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "relu3_bank2"
  type: "ReLU"
  bottom: "conv3_bank2"
  top: "conv3_bank2"
}

layer {
  name: "pool3_bank2"
  type: "Pooling"
  bottom: "conv3_bank2"
  top: "pool3_bank2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

# ########### conv4_1_bank2
layer {
  name: "conv4_1_bank2"
  type: "Convolution"
  bottom: "pool3_bank2"
  top: "conv4_1_bank2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "relu4_1_bank2"
  type: "ReLU"
  bottom: "conv4_1_bank2"
  top: "conv4_1_bank2"
}

# ########### conv4_2_bank2
layer {
  name: "conv4_2_bank2"
  type: "Convolution"
  bottom: "conv4_1_bank2"
  top: "conv4_2_bank2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 4
    kernel_size: 9
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "relu4_2_bank2"
  type: "ReLU"
  bottom: "conv4_2_bank2"
  top: "conv4_2_bank2"
}

# ########### conv4_bank2 for dsn
# loss
# conv & resize
layer {
  name: "dsn_conv4_bank2"
  type: "Convolution"
  bottom: "conv4_2_bank2"
  top: "dsn_conv4_bank2"
  param {
    lr_mult: 0.01
    decay_mult: 1
  }
  param {
    lr_mult: 0.02
    decay_mult: 0
  }
  convolution_param {
    num_output: 14
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "re_heat_maps_dsn_conv4_bank2"
  type: "Resize"
  bottom: "heat_maps"
  bottom: "dsn_conv4_bank2"
  top: "re_heat_maps_dsn_conv4_bank2"
  include {
    phase: TRAIN
  }
}

layer {
  name: "pose_heap_map_loss_by_conv4_bank2"
  type: "PoseHeatMapLoss"
  bottom: "dsn_conv4_bank2"
  bottom: "re_heat_maps_dsn_conv4_bank2"
  bottom: "heat_maps_masks"
  top: "pose_heap_map_loss_by_conv4_bank2"
  include {
    phase: TRAIN
  }
  loss_weight: 1
  pose_heat_map_loss_param {
    loss_emphase_type: 3
    fg_eof: 3
    bg_eof: 1
    ratio: 0.005
    prob_num: 11
    heat_score_thres: 0.273
    parts_err_num_thres: 3
    hard_negative_filepath: "NotImplemented."
  }
}

# ##############################
# test
# visualize & accuracy
layer {
  name: "re_dsn_conv4_bank1"
  type: "Resize"
  bottom: "dsn_conv4_bank1"
  bottom: "heat_maps"
  top: "re_dsn_conv4_bank1"
  include {
    phase: TEST
  }
}
layer {
  name: "re_dsn_conv4_bank2"
  type: "Resize"
  bottom: "dsn_conv4_bank2"
  bottom: "heat_maps"
  top: "re_dsn_conv4_bank2"
  include {
    phase: TEST
  }
}

layer {
  name: "fusion_heat_map"
  type: "Eltwise"
  bottom: "re_dsn_conv4_bank1"
  bottom: "re_dsn_conv4_bank2"
  top: "fusion_heat_map"
  include {
    phase: TEST
  }
  eltwise_param {
    operation: SUM
  }
}

# re_dsn_conv4_bank1
layer {
  name: "pred_coords_from_maps1"
  type: "CoordsFromHeatMaps"
  bottom: "re_dsn_conv4_bank1"
  top: "pred_pose_coords1"
  include {
    phase: TEST
  }
  is_disp_info: true
  pose_coords_from_heat_maps_param {
    top_k: 30
    heat_map_a: 1
    heat_map_b: 0
  }
} 
layer {
  name: "pred_rescale_pose_coords1"
  type: "RescaledPoseCoords"
  bottom: "pred_pose_coords1"
  bottom: "aux_info"
  top: "pred_pose_coords1"
  include {
    phase: TEST
  }
}

# re_dsn_conv4_bank2
layer { 
  name: "pred_coords_from_maps2"
  type: "CoordsFromHeatMaps"
  bottom: "re_dsn_conv4_bank2"
  top: "pred_pose_coords2"
  include {
    phase: TEST
  }
  is_disp_info: true
  pose_coords_from_heat_maps_param {
    top_k: 30
    heat_map_a: 1
    heat_map_b: 0
  }
}
layer {
  name: "pred_rescale_pose_coords2"
  type: "RescaledPoseCoords"
  bottom: "pred_pose_coords2"
  bottom: "aux_info"
  top: "pred_pose_coords2"
  include {
    phase: TEST
  }
}

# fusion_heat_map
layer {
  name: "pred_coords_from_maps3"
  type: "CoordsFromHeatMaps"
  bottom: "fusion_heat_map"
  top: "pred_pose_coords3"
  include {
    phase: TEST
  }
  is_disp_info: true
  pose_coords_from_heat_maps_param {
    top_k: 30
    heat_map_a: 1
    heat_map_b: 0
  }
}
layer {
  name: "pred_rescale_pose_coords3"
  type: "RescaledPoseCoords"
  bottom: "pred_pose_coords3"
  bottom: "aux_info"
  top: "pred_pose_coords3"
  include {
    phase: TEST
  }
}

layer {
  name: "gt_rescale_pose_coords"
  type: "RescaledPoseCoords"
  bottom: "gt_pose_coords"
  bottom: "aux_info"
  top: "gt_origin_pose_coords"
  include {
    phase: TEST
  }
}

layer {
  name: "accuracy1"
  type: "PosePDJAccuracy"
  bottom: "pred_pose_coords1"
  bottom: "gt_origin_pose_coords"
  top: "accuracy1"
  include {
    phase: TEST
  }
  pose_pdj_accuracy_param {
    acc_factor: 0.05
    acc_factor_num: 10
    images_num: 1016
    acc_name: "pose_pdj_acc1.log"
    log_name: "pose_pdj_log1.log"
    acc_path: "../asserts/models/Pose/FLIC/black/lecun-8x-2b-sd5_5-marks-dsn/test_acc_side/"
    shoulder_id: 6
    hip_id: 10
  }
}

layer {
  name: "accuracy2"
  type: "PosePDJAccuracy"
  bottom: "pred_pose_coords2"
  bottom: "gt_origin_pose_coords"
  top: "accuracy2"
  include {
    phase: TEST
  }
  pose_pdj_accuracy_param {
    acc_factor: 0.05
    acc_factor_num: 10
    images_num: 1016
    acc_name: "pose_pdj_acc2.log"
    log_name: "pose_pdj_log2.log"
    acc_path: "../asserts/models/Pose/FLIC/black/lecun-8x-2b-sd5_5-marks-dsn/test_acc_side/"
    shoulder_id: 6
    hip_id: 10
  }
}

layer {
  name: "accuracy3"
  type: "PosePDJAccuracy"
  bottom: "pred_pose_coords3"
  bottom: "gt_origin_pose_coords"
  top: "accuracy3"
  include {
    phase: TEST
  }
  pose_pdj_accuracy_param {
    acc_factor: 0.05
    acc_factor_num: 10
    images_num: 1016
    acc_name: "pose_pdj_acc3.log"
    log_name: "pose_pdj_log3.log"
    acc_path: "../asserts/models/Pose/FLIC/black/lecun-8x-2b-sd5_5-marks-dsn/test_acc_side/"
    shoulder_id: 6
    hip_id: 10
  }
}